[
  {
    "titre": "Cube website project",
    "cheminImage": "assets/cubeProject/cube.png",
    "description": "A team project of a complete website inspired by the bicycle brand CUBE website using Laravel, PostgreSQL, and all modelling diagrams.",
    "localisation": "University of Savoy, IUT Annecy, Annecy-Le-Vieux, France",
    "competences": ["Laravel", "PostgreSQL", "UML", "Web Design", "Power AMC"],
    "date": "Oct. 2025 - March 2026",
    "status": "Ongoing",
    "lienProjet": "https://github.com/ElvisAndr/SAE201_ANDRIANANTOANDRO_PERSONENI",
    "texteLien": "See project on github",
    "infosSupplementaires": [
      {
        "image": "assets/cubeProject/mcd.png",
        "description": "This conceptual data model (MCD) outlines the database architecture for a comprehensive e-commerce platform. It structures the complete user journey, from product browsing (using categories, stock, and characteristics) to a persistent shopping cart (PANIER) and a full order fulfillment pipeline (COMMANDE), including payment and delivery tracking."
      },
      {
        "image": "assets/cubeProject/mld.png",
        "description": "This Logical Data Model (MLD) translates the conceptual e-commerce model into a concrete relational database schema. It defines all tables, establishes primary keys and foreign keys to build relationships, and resolves all many-to-many associations into dedicated junction tables. This model is fully normalized and ready for SQL implementation."
      },
      {
        "image": "assets/cubeProject/finalVisuel.png",
        "description": "The final design of the website, developed using the Laravel framework. The site prioritizes a strong visual identity and intuitive ergonomics to ensure a high-quality user experience."
      }
    ]
  },
  {
    "titre": "Data Manipulation & Analysis",
    "cheminImage": "assets/dataAnalysisProject/listic.png",
    "description": "A team project of data manipulation and analysis for LISTIC using PostgreSQL, Excel and Power BI.",
    "localisation": "University of Savoy, IUT Annecy, Annecy-Le-Vieux, France",
    "competences": ["PostgreSQL", "Excel", "Power BI", "Power AMC"],
    "date": "March - April 2025",
    "status": "Done",
    "lienProjet": "https://drive.google.com/drive/folders/16KbPPACGpSO_3AX1cPEB6zS2bVnnrv1i?usp=drive_link",
    "texteLien": "Download project deliverables",
    "infosSupplementaires": [
      {
        "image": "assets/dataAnalysisProject/excel.png",
        "description": "Excel statistical dashboard showcasing Z-score filtering for outlier detection, linear regression modeling for trend analysis, and inter-quartile segmentation of equipment usage."
      }
    ]
  },
  {
    "titre": "Stock Management Project",
    "cheminImage": "assets/pilotProject/pilot.png",
    "description": "Worked within a university project team to deliver a complete stock management system for Pilot, taking the lead on database design (MCD, MLD, PostgreSQL), UI/UX prototyping in Figma, and C# application development.",
    "localisation": "University of Savoy, IUT Annecy, Annecy-Le-Vieux, France",
    "competences": ["C#", "PostgreSQL", "Figma", "Project Management", "Power AMC"],
    "date": "April - June 2025",
    "status": "Done",
    "lienProjet": "https://github.com/ElvisAndr/SAE201_ANDRIANANTOANDRO_PERSONENI",
    "texteLien": "See project on github",
    "infosSupplementaires": [
      {
        "image": "assets/pilotProject/figmaPilot.png",
        "description": "High-fidelity prototype designed on Figma before coding. Everything was made from scratch without any template."
      },
      {
        "image": "assets/pilotProject/pilotProjectManagement.png",
        "description": "This project focuses on planning and coordinating the full production process of a Pilot pen, from product data verification to final manufacturing. The Gantt chart outlines the entire workflow and its dependencies, divided into two main phases: Lot A (upstream planning) and Lot B (production execution)."
      },
      {
        "image": "assets/pilotProject/accueil.png",
        "description": "The main dashboard displaying the full product catalog with advanced filtering options (category, type, color) and real-time stock levels."
      },
      {
        "image": "assets/pilotProject/selectionRevendeur.png",
        "description": "An interface allowing users to search for and select an existing retailer from the database or create a new one."
      },
      {
        "image": "assets/pilotProject/createCommande.png",
        "description": "The order building screen where users can filter products, add specific items to their cart, and choose a delivery method."
      },
      {
        "image": "assets/pilotProject/recapitulatifCommande.png",
        "description": "A recap view detailing the selected retailer, delivery dates, list of ordered items, and the total price before validation."
      },
      {
        "image": "assets/pilotProject/detailsProduit.png",
        "description": "A detailed view of a specific item showing technical specifications, pricing, current stock, and a product image."
      }
    ]
  },
  {
    "titre": "Portfolio Designing Project",
    "cheminImage": "assets/portfolioProject/myportfolio.png",
    "description": "Design and development of a personal interactive portfolio. Focus on UI/UX, responsive animations (Carousel, Focus Mode) and clean code architecture using JavaScript.",
    "competences": ["Web Design"],
    "date": "Oct. - Nov. 2025",
    "status": "Done",
    "lienProjet": "https://github.com/ElvisAndr/myPortfolio.git",
    "texteLien": "See project on github"
  }
]